tap "anomalyco/tap"
tap "lizardbyte/homebrew", "https://github.com/LizardByte/homebrew-homebrew", trusted: true
tap "terror/tap"
tap "ublue-os/tap", trusted: true
tap "valkyrie00/bbrew", "https://github.com/Valkyrie00/homebrew-bbrew"
# Simple, modern, secure file encryption
brew "age"
# Download with resuming and segmented downloading
brew "aria2"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Preexec and precmd functions for Bash (like Zsh)
brew "bash-preexec"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Load/unload environment variables based on $PWD
brew "direnv"
# Linux utility to get information on filesystems, like df but better
brew "dysk"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Text editor for your terminal: easy, powerful and fast
brew "fresh-editor"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# NCurses Disk Usage
brew "ncdu"
# Utility for managing network connections
brew "netcat"
# Command-line Git information tool
brew "onefetch"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Display and control your Android device
brew "scrcpy"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Editor of encrypted files
brew "sops"
# Cross-shell prompt for astronauts
brew "starship"
# Stress test a computer system in various selectable ways
brew "stress-ng"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Modern SSH server for teams managing distributed infrastructure
brew "teleport"
# General purpose fuzzy finder TUI
brew "television"
# Ultra fast grep with query UI, fuzzy search, archive search, and more
brew "ugrep"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Self-hosted game stream host for Moonlight
brew "lizardbyte/homebrew/sunshine", trusted: true
# Android SDK component
cask "android-platform-tools"
# AI Coding Agent IDE
cask "ublue-os/tap/antigravity-ide-linux", trusted: true
# JetBrains tools manager
cask "ublue-os/tap/jetbrains-toolbox-linux"
# Open-source code editor
cask "ublue-os/tap/visual-studio-code-linux", trusted: true
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "continue.continue"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "franneck94.workspace-formatter"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "icrawl.discord-vscode"
vscode "leonardssh.vscord"
vscode "matthewpi.caddyfile-support"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "myriad-dreamin.tinymist"
vscode "naumovs.color-highlight"
vscode "nefrob.vscode-just-syntax"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "sst-dev.opencode"
vscode "supermaven.supermaven"
vscode "tabbyml.vscode-tabby"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "tyriar.sort-lines"
vscode "usernamehw.errorlens"
vscode "vizards.deepseek-v4-for-copilot"
vscode "yoavbls.pretty-ts-errors"
vscode "yy0931.vscode-sqlite3-editor"
vscode "yzhang.markdown-all-in-one"
flatpak "app.zen_browser.zen"
flatpak "com.bitwarden.desktop"
flatpak "com.brave.Browser"
flatpak "com.github.tchx84.Flatseal"
flatpak "com.github.wwmm.easyeffects"
flatpak "com.heroicgameslauncher.hgl"
flatpak "com.leinardi.gst"
flatpak "com.protonvpn.www"
flatpak "com.vysp3r.ProtonPlus"
flatpak "dev.vencord.Vesktop"
flatpak "fr.handbrake.ghb"
flatpak "im.riot.Riot"
flatpak "io.github.giantpinkrobots.varia"
flatpak "io.github.ilya_zlobintsev.LACT"
flatpak "io.missioncenter.MissionCenter"
flatpak "io.mpv.Mpv"
flatpak "it.mijorus.gearlever"
flatpak "md.obsidian.Obsidian"
flatpak "net.lutris.Lutris"
flatpak "org.freedesktop.Piper"
flatpak "org.gnome.Evince"
flatpak "org.jdownloader.JDownloader"
flatpak "org.kde.dolphin"
flatpak "org.kde.gwenview"
flatpak "org.kde.kalk"
flatpak "org.kde.krdc"
flatpak "org.libreoffice.LibreOffice"
flatpak "org.polymc.PolyMC"
flatpak "org.telegram.desktop"
